<?php

/*
===========================================================

	프로젝트 이름 : 피리 웹 프로그램 - 피리 맵 페이지

	만든사람 : 피리 PIREE

	홈페이지 : http://www.piree.co.kr

	작성날짜 : 2016년 01월 24일 일요일 오전 06시 44분 - 날씨 추워, 추워!! 너무 추워!!

	P770033 업데이트날짜 : 2016년 11월 11일 금요일 오전 1시 00분 - 날씨 맑음

===========================================================
 피리 > 피리 맵 페이지 > 확장 > 피리
===========================================================


*/


		#######################################################
		# 시작 => 선처리
		#######################################################

		//=====================================================
		// 개별_페이지__접근_불가
		IF ( !defined('_GNUBOARD_'))										EXIT;

		#######################################################
		# 끝 => 선처리
		#######################################################






###########################################################
# 시작 => 피리__SAM
###########################################################


		#######################################################
		# 시작 => PIREE__상수
		#######################################################

		//=====================================================
		// 피리__유료__프로그램_그룹_번호
		define('G_PLUS_PROG_N', '770');


		//=====================================================
		// 피리__일반_웹_유료_프로그램__그룹_대표_번호
		define('PIREE_PROG_PLUS_MENU_N', '770001');


		//=====================================================
		// 오늘_날짜_숫자
		define('G5_TODAY_DATE_N', date("Ymd"));


		//=====================================================
		// 디렉토리
		define('PIREE_DIR',								'piree');
		define('PIREE_CSS_DIR',						'_css');
		define('PIREE_JS_DIR',						'_js');
		define('PIREE_LIB_DIR',						'_lib');
		define('PIREE_LIBS_DIR',					'libs');
		define('PIREE_IMAGE2_DIR',				'_image');
		define('PIREE_INC_DIR',						'_inc');
		define('PIREE_IMAGE_DIR',					'_image');
		define('PIREE_SKIN_PC_DIR',				'_skin_pc');
		define('PIREE_SKIN_MO_DIR',				'_skin_mo');
		define('PIREE_IMAGE_UPLOAD_DIR',	'IMG_UP');

		// 데이터_상수__추가 / 2016년 07월 16일 토요일 오전 03시 23분 - 날씨 비옴
		define('PIREE_DATA_DIR',					PIREE_DIR);


		//=====================================================
		// URL
		define('PIREE_URL',						G5_URL .'/'. PIREE_DIR);
		define('PIREE_CSS_URL',				PIREE_URL .'/'. PIREE_CSS_DIR);
		define('PIREE_JS_URL',				PIREE_URL .'/'. PIREE_JS_DIR);
		define('PIREE_LIB_URL',				PIREE_URL .'/'. PIREE_LIB_DIR);
		define('PIREE_LIBS_URL',			PIREE_URL .'/'. PIREE_LIBS_DIR);
		define('PIREE_IMAGE2_URL',		PIREE_URL .'/'. PIREE_IMAGE2_DIR);
		define('PIREE_INC_URL',				PIREE_URL .'/'. PIREE_INC_DIR);
		define('PIREE_IMAGE_URL',			PIREE_URL .'/'. PIREE_IMAGE_DIR);
		define('PIREE_SKIN_PC_URL',		PIREE_URL .'/'. PIREE_SKIN_PC_DIR);
		define('PIREE_SKIN_MO_URL',		PIREE_URL .'/'. PIREE_SKIN_MO_DIR);
		define('PIREE_UP_IMAGE_URL',	G5_DATA_URL .'/'. PIREE_IMAGE_UPLOAD_DIR);

		// 데이터_상수__추가 / 2016년 07월 16일 토요일 오전 03시 23분 - 날씨 비옴
		define('PIREE_DATA_URL',			G5_DATA_URL .'/'. PIREE_DATA_DIR);


		//=====================================================
		// PATH
		define('PIREE_PATH',					G5_PATH .'/'. PIREE_DIR);
		define('PIREE_CSS_PATH',			PIREE_PATH .'/'. PIREE_CSS_DIR);
		define('PIREE_JS_PATH',				PIREE_PATH .'/'. PIREE_JS_DIR);
		define('PIREE_LIB_PATH',			PIREE_PATH .'/'. PIREE_LIB_DIR);
		define('PIREE_LIBS_PATH',			PIREE_PATH .'/'. PIREE_LIBS_DIR);
		define('PIREE_IMAGE2_PATH',		PIREE_PATH .'/'. PIREE_IMAGE2_DIR);
		define('PIREE_INC_PATH',			PIREE_PATH .'/'. PIREE_INC_DIR);
		define('PIREE_IMAGE_PATH',		PIREE_PATH .'/'. PIREE_IMAGE_DIR);
		define('PIREE_SKIN_PC_PATH',	PIREE_PATH .'/'. PIREE_SKIN_PC_DIR);
		define('PIREE_SKIN_MO_PATH',	PIREE_PATH .'/'. PIREE_SKIN_MO_DIR);
		define('PIREE_UP_IMAGE_PATH',	G5_DATA_PATH .'/'. PIREE_IMAGE_UPLOAD_DIR);

		// 데이터_상수__추가 / 2016년 07월 16일 토요일 오전 03시 23분 - 날씨 비옴
		define('PIREE_DATA_PATH',			G5_DATA_PATH .'/'. PIREE_DATA_DIR);


		//=====================================================
		// 현재_URL
		define('PIREE_THIS_URL',			"http://". $_SERVER["HTTP_HOST"].$_SERVER["REQUEST_URI"]);
		define('PIREE_THIS_URL_ENC',	BASE64_ENCODE(PIREE_THIS_URL));

		#######################################################
		# 끝 => PIREE__상수
		#######################################################



		#######################################################
		# 시작 => 프로그램__번호
		# 2016년 05월 18일 수요일 오전 04시 01분 - 날씨 맑음
		#######################################################

		//=================================================
		// 프로그램__번호
		define('PIREE_PLUS_LEVEL_HELPER_N',					770002);		// LEVEL_HELPER__레벨_도우미
		define('PIREE_PLUS_LEVEL_HELPER_COLOR_N',		770003);		// LEVEL_HELPER_COLOR__레벨_도우미_칼라
		define('PIREE_PLUS_ATTEND_N',								770004);		// ATTEND_CHECK__출석체크
		define('PIREE_PLUS_SH_URL_N',								770005);		// SH_URL__단축_URL
		define('PIREE_PLUS_REPORT_N',								770006);		// REPORT_PROG__신고하기
		define('PIREE_PLUS_ANNONCE_N',							770007);		// 새알림_내글반응
		define('PIREE_PLUS_BO_CATE_N',							770008);		// BO_CATE__피리_그누보드_카테고리
		define('PIREE_PLUS_UPHILL_N',								770009);		// UPHILL__끌어올림
		define('PIREE_PLUS_MINIGEUL_N',							770010);		// MINIGEUL__번호
		define('PIREE_PLUS_MARKET_SKIN_N',					770012);		// MARKET_SKIN__장터_게시판_스킨
		define('PIREE_PLUS_MEMBER_PAGE_N',					770016);		// MEMBER_PAGE__마이페이지
		define('PIREE_PLUS_BOARD_FUNC_N',						770019);		// BOARD_FUNC__그누보드_추가_기능
		define('PIREE_PLUS_BICYCLE_PEOPLE_BOOK_N',	770025);		// BICYCLE_PEOPLE_BOOK__자전거_동호인_인명부
		define('PIREE_PLUS_PIREE_MAP_PAGE_N',				770033);		// PIREE_MAP_PAGE__앱_페이지
		define('PIREE_PLUS_PIREE_ARTICLE_VOTE_N',		770034);		// PIREE_ARTICLE_VOTE__게시글에_투표
		define('PIREE_PLUS_REGION_MANAGE_N',				770036);		// REGION_MANAGE__지역관리
/*

		define('PIREE_PLUS_LEVEL_HELPER_N', 770011);						// 
		define('PIREE_PLUS_LEVEL_HELPER_N', 770012);						// 
		define('PIREE_PLUS_LEVEL_HELPER_N', 770013);						// 
		define('PIREE_PLUS_LEVEL_HELPER_N', 770014);						// 
		define('PIREE_PLUS_LEVEL_HELPER_N', 770015);						// 
		define('PIREE_PLUS_LEVEL_HELPER_N', 770017);						// 
		define('PIREE_PLUS_LEVEL_HELPER_N', 770018);						// 
		define('PIREE_PLUS_LEVEL_HELPER_N', 770019);						// 
		define('PIREE_PLUS_LEVEL_HELPER_N', 770020);						// 
		define('PIREE_PLUS_LEVEL_HELPER_N', 770021);						// 
		define('PIREE_PLUS_LEVEL_HELPER_N', 770022);						// 
		define('PIREE_PLUS_LEVEL_HELPER_N', 770023);						// 
		define('PIREE_PLUS_LEVEL_HELPER_N', 770024);						// 
		define('PIREE_PLUS_LEVEL_HELPER_N', 770025);						// 
		define('PIREE_PLUS_LEVEL_HELPER_N', 770026);						// 
		define('PIREE_PLUS_LEVEL_HELPER_N', 770027);						// 
		define('PIREE_PLUS_LEVEL_HELPER_N', 770028);						// 
		define('PIREE_PLUS_LEVEL_HELPER_N', 770029);						// 
		define('PIREE_PLUS_LEVEL_HELPER_N', 770030);						// 
		define('PIREE_PLUS_LEVEL_HELPER_N', 770031);						// 
		define('PIREE_PLUS_LEVEL_HELPER_N', 770032);						// 
		define('PIREE_PLUS_LEVEL_HELPER_N', 770033);						// 
		define('PIREE_PLUS_LEVEL_HELPER_N', 770034);						// 
		define('PIREE_PLUS_LEVEL_HELPER_N', 770035);						// 
		define('PIREE_PLUS_LEVEL_HELPER_N', 770036);						// 
		define('PIREE_PLUS_LEVEL_HELPER_N', 770037);						// 
		define('PIREE_PLUS_LEVEL_HELPER_N', 770038);						// 
		define('PIREE_PLUS_LEVEL_HELPER_N', 770039);						// 
		define('PIREE_PLUS_LEVEL_HELPER_N', 770040);						// 
		define('PIREE_PLUS_LEVEL_HELPER_N', 770041);						// 
		define('PIREE_PLUS_LEVEL_HELPER_N', 770042);						// 
		define('PIREE_PLUS_LEVEL_HELPER_N', 770043);						// 
		define('PIREE_PLUS_LEVEL_HELPER_N', 770044);						// 
		define('PIREE_PLUS_LEVEL_HELPER_N', 770045);						// 
		define('PIREE_PLUS_LEVEL_HELPER_N', 770046);						// 
		define('PIREE_PLUS_LEVEL_HELPER_N', 770047);						// 
		define('PIREE_PLUS_LEVEL_HELPER_N', 770048);						// 
		define('PIREE_PLUS_LEVEL_HELPER_N', 770049);						// 
		define('PIREE_PLUS_LEVEL_HELPER_N', 770050);						// 
*/

		#######################################################
		# 끝 => 프로그램__번호
		#######################################################



		#######################################################
		# 시작 => 상수__변수
		#######################################################

    //=====================================================
    // 요일
    $yoil_s_arr = array ('일', '월', '화', '수', '목', '금', '토');
    $yoil_l_arr = array ('일요일', '월요일', '화요일', '수요일', '목요일', '금요일', '토요일');

		#######################################################
		# 끝 => 상수__변수
		#######################################################



		#######################################################
		# 시작 => 테이블__이름
		#######################################################


		//=====================================================
		// 피리_프로그램__테이블
		$piree['program_sam'] = G5_TABLE_PREFIX .'_piree__program_sam';


		//=====================================================
		// 달력__테이블
		$piree['calendar'] = G5_TABLE_PREFIX .'_piree__calendar';


		//=====================================================
		// 게시판__확장__기능__테이블
		$piree['gnu_board_extend'] = G5_TABLE_PREFIX .'_piree_'. G_PLUS_PROG_N .'_gnu_board_extend';


		//=====================================================
		// 활동_수치_정보__게시판
		$piree['member_count_article'] = G5_TABLE_PREFIX .'_piree_'. G_PLUS_PROG_N .'_member_count_article';


		//=====================================================
		// 활동_수치_정보__댓글
		$piree['member_count_comment'] = G5_TABLE_PREFIX .'_piree_'. G_PLUS_PROG_N .'_member_count_comment';


		//=====================================================
		// 회원_활동_현황__테이블
		$piree['member_active_state'] = G5_TABLE_PREFIX .'_piree__member_active_state';


		//=====================================================
		// 출석체크__기록__테이블
		$piree['attend_list'] = G5_TABLE_PREFIX .'_piree_'. PIREE_PLUS_ATTEND_N .'_attend_list';


		//=====================================================
		// 신고하기__항목__테이블
		$piree['report_reason'] = G5_TABLE_PREFIX .'_piree_'. PIREE_PLUS_REPORT_N .'_report_reason';


		//=====================================================
		// 신고하기__기록__테이블
		$piree['report_list'] = G5_TABLE_PREFIX .'_piree_'. PIREE_PLUS_REPORT_N .'_report_list';


		//=====================================================
		// HOST__INDEX__테이블
		$piree['host_index'] = G5_TABLE_PREFIX .'_piree__host';


		#######################################################
		# 끝 => 테이블__이름
		#######################################################


###########################################################
# 끝 => 피리__SAM
###########################################################






###########################################################
# 시작 => DB__함수
###########################################################


		#######################################################
		# 시작 => 행의_첫번째_결과__가져오기
		#######################################################
		function sql_efv($sql, $error=G5_DISPLAY_SQL_ERROR, $link=null)
		{

				global $g5;

				if(!$link)
						$link = $g5['connect_db'];

				$result = sql_query($sql, $error, $link);
				//$row = @sql_fetch_array($result) or die("<p>$sql<p>" . mysqli_errno() . " : " .	mysqli_error() . "<p>error file : $_SERVER['SCRIPT_NAME']");
				$row = sql_fetch_array($result);
				//return $row[0];
				//return $row;

				$loop_n = 0;

				$return_var = '';

				WHILE (  list($key, $val) = each($row) )
				{
						IF ( $loop_n == 0 )
						{
								$return_var = $val;
						}

						$loop_n++;
				}

				return $return_var;

		}
		#######################################################
		# 끝 => 행의_첫번째_결과__가져오기
		#######################################################



		#######################################################
		# 시작 => 행의_첫번째_결과__가져오기
		#######################################################
		function sql_efv_old($sql, $error=TRUE)
		{

			$state = sql_query($sql, $error);
			$row	 = @mysql_fetch_array($state);
			return $row[0];

		}
		#######################################################
		# 끝 => 행의_첫번째_결과__가져오기
		#######################################################



		#######################################################
		# 시작 => 쿼리_실행__결과_메세지__보여주기
		#######################################################
		function query_res($sql, $msg_s = '', $msg_echo = 'alert', $is_exit = 1)
		{

				//=================================================
				// 시작 => 쿼리_실행
				IF ( !sql_query($sql) )
				{

						//=============================================
						// 시작 => 메세지__있으면
						IF ( $msg_echo )
						{

								//=========================================
								// 시작 => 메세지_출력__방법
								SWITCH ( $msg_s )
								{
										CASE 'echo' :						echo $msg_s;						BREAK;
										CASE 'alert' :					alert($msg_s);					BREAK;
										CASE 'return' :					return $msg_s;					BREAK;
										DEFAULT :								alert($msg_s);					BREAK;
								}
								// 끝 => 메세지_출력__방법
								//=========================================

						}
						// 끝 => 메세지__있으면
						//=============================================


						//=============================================
						// 시작 => 끝내기__이면
						IF ( $is_exit == 1 )
						{
								EXIT;
						}
						// 끝 => 끝내기__이면
						//=============================================

				}
				// 끝 => 쿼리_실행
				//=================================================

		}
		#######################################################
		# 끝 => 쿼리_실행__결과_메세지__보여주기
		#######################################################


###########################################################
# 끝 => DB__함수
###########################################################






###########################################################
# 시작 => 일반__함수
###########################################################


		#######################################################
		# 시작 => 에러__보여주기
		#######################################################
		function error_layer($msg)
		{

				//=================================================
				// 에러_출력
?>
				<br class="cl_bo"><br class="cl_bo">

				<div style="margin:20px 10px 0 10px; padding:14px 10px 14px 20px; border:5px solid #ffe0e0;">
						<span style="color:#ff4444; font-weight:bold; font-size:11pt;"><?php echo $msg ?></span>
				</div>
<?php
				exit;

		}
		#######################################################
		# 끝 => 에러__보여주기
		#######################################################



		#######################################################
		# 시작 => AJAX__에러_메세지__출력
		#######################################################
		function alert_ajax($msg)
		{

				//=================================================
				// 에러_메세지_출력
				echo "#ERROR:". clean_xss_tags(stripslashes($msg));
				exit;

		}
		#######################################################
		# 끝 => AJAX__에러_메세지__출력
		#######################################################



		#######################################################
		# 시작 => iColorPicker__자바스크립트__불러오기
		#######################################################
		function load__iColorPicker()
		{

		 		//=================================================
		  	// 주소복사_기능__출력하기
?>
				<script>
					var iColorPicker_icon_url = "<?php echo PIREE_IMAGE_URL ?>/iColorPicker.png";
				</script>

				<script type="text/javascript" src="<?php echo PIREE_JS_URL ?>/iColorPicker.js"></script>
				<script type="text/javascript" src="http://ajax.googleapis.com/ajax/libs/jquery/1.7.2/jquery.min.js"></script>
<?php

		}
		#######################################################
		# 끝 => iColorPicker__자바스크립트__불러오기
		#######################################################



		#######################################################
		# 시작 => 배열에서_정보__뽑아내기
		#######################################################
		function get__array_value($arrs, $fd_name, $var_val)
		{

				//=================================================
				// 넘겨줄_값
				$get__val = 0;


				//=================================================
				// 시작 => 배열이면
				IF ( is_array($arrs))
				{

						//=============================================
						// 시작 => 조건_필드__있으면
						IF ( $fd_name)
						{

								//=========================================
								// 시작 => 조건_값__있으면
								IF ( $var_val)
								{

										//=====================================
										// 시작 => 배열_건수__있으면
										IF ( count($arrs) > 0 )
										{

												//=================================
												// 시작 => 원하는_정보__가져오는_방식
												SWITCH ($fd_name)
												{

														//=============================
														// 시작 => 번호_로__이름__알아내기
														CASE "num_name" :

																WHILE ( list($key, $val) = each($arrs))
																{
																	// 번호_가__같으면
																	IF ( $var_val == $val['num'] )				$get__val = $val["name"];
																}

														BREAK;
														// 끝 => 번호_로__이름__알아내기
														//=============================


														//=============================
														// 시작 => 번호_로__메모__알아내기
														CASE "num_memo" :

																WHILE ( list($key, $val) = each($arrs))
																{
																	// 번호_가__같으면
																	IF ( $var_val == $val['num'] )				$get__val = $val["memo"];
																}

														BREAK;
														// 끝 => 번호_로__메모__알아내기
														//=============================


														//=============================
														// 시작 => 번호_로__코드__알아내기
														CASE "num_code" :

																WHILE ( list($key, $val) = each($arrs))
																{
																	// 번호_가__같으면
																	IF ( $var_val == $val['num'] )				$get__val = $val["code"];
																}

														BREAK;
														// 끝 => 번호_로__코드__알아내기
														//=============================


														//=============================
														// 시작 => 코드_로__번호__알아내기
														CASE 'code_num' :

																WHILE ( list($key, $val) = each($arrs))
																{
																	// 코드_가__같으면
																	IF ( $var_val == $val["code"] )				$get__val = $val['num'];
																}

														BREAK;
														// 끝 => 코드_로__번호__알아내기
														//=============================


														//=============================
														// 시작 => 이름_으로__번호__알아내기
														CASE "name_num" :

																WHILE ( list($key, $val) = each($arrs))
																{
																	// 코드_가__같으면
																	IF ( $var_val == $val["name"] )				$get__val = $val['num'];
																}

														BREAK;
														// 끝 => 이름_으로__번호__알아내기
														//=============================


														//=============================
														// 시작 => 코드_로__이름__알아내기
														CASE "code_name" :

																WHILE ( list($key, $val) = each($arrs))
																{
																	// 코드_가__같으면
																	IF ( $var_val == $val["code"] )				$get__val = $val["name"];
																}

														BREAK;
														// 끝 => 코드_로__번호__알아내기
														//=============================


														//=============================
														// 시작 => 번호_로__모두_가져오기
														CASE "num_all" :

																WHILE ( list($key, $val) = each($arrs))
																{
																	// 모두 가져오기 배열에 저장
																	IF ( $var_val == $val['num'] )				$get__val = $val;
																}

														BREAK;
														// 끝 => 번호_로__모두_가져오기
														//=============================


														//=============================
														// 시작 => 코드로__모두_가져오기
														CASE "code_all" :

																WHILE ( list($key, $val) = each($arrs))
																{
																	// 모두 가져오기 배열에 저장
																	IF ( $var_val == $val["code"] )				$get__val = $val;
																}

														BREAK;
														// 끝 => 코드로__모두_가져오기
														//=============================


														//=============================
														// 시작 => 이름으로__모두_가져오기
														CASE "name_all" :

																WHILE ( list($key, $val) = each($arrs))
																{
																	// 모두 가져오기 배열에 저장
																	IF ( $var_val == $val["name"] )				$get__val = $val;
																}

														BREAK;
														// 끝 => 이름으로__모두_가져오기
														//=============================


														//=============================
														// 시작 => 값으로__키__가져오기
														CASE "val_key" :

																WHILE ( list($key, $val) = each($arrs))
																{
																	// 모두 가져오기 배열에 저장
																	IF ( $var_val == $val)								$get__val = $key;
																}

														BREAK;
														// 끝 => 값으로__키__가져오기
														//=============================

												}
												// 끝 => 원하는_정보__가져오는_방식
												//=================================


												//=================================
												// 값__없으면
												IF ( !$get__val)										 						$get__val = 0;

										}
										// 끝 => 배열_건수__있으면
										//=====================================

								}
								// 끝 => 조건_값__있으면
								//=========================================

						}
						// 끝 => 조건_필드__있으면
						//=============================================

				}
				# 끝 => 배열이면
				#################################################


				//=================================================
				// 넘겨주기
				return $get__val;

		}
		#######################################################
		# 끝 => 배열에서_정보__뽑아내기
		#######################################################



		#######################################################
		# 시작 => 입력_폼_안내문__출력
		#######################################################
		function echo_help($help_s="")
		{

				$str  = '<span class="piree_help_str">'. str_replace("\n", "<br />", $help_s) .'</span>';

				echo $str;

		}
		#######################################################
		# 끝 => 입력_폼_안내문__출력
		#######################################################



		#######################################################
		# 시작 => 페이지__이동
		#######################################################
		function go_url($go_url_s, $go_time_n)
		{

				// 이동할_URL
				$go_url_s = str_replace("&amp;", "&", $go_url_s);

				// 이동_대기_시간
				IF ( !$go_time_n || $go_time_n < 1)				 $go_time_n = 0;

				// 페이지__이동
				echo '<meta http-equiv="refresh" content="'.$go_time_n.';url='.$go_url_s.'" />';
				EXIT;

		}
		#######################################################
		# 끝 => 페이지__이동
		#######################################################



		#######################################################
		# 시작 => 회원권한을__SELECT_형식으로__얻음
		#######################################################
		function get_member_level_select__piree($name, $start_id=0, $end_id=10, $selected="", $event="", $disabled="")
		{

				//=================================================
				// 전역변수
				global $g5;


				//=================================================
				// TAG_문자열
				$str = "\n<select id=\"". $name ."\" name=\"". $name ."\"";


				//=================================================
				// 이벤트_있으면
				IF ( $event) 															$str .= " ". $event;


				//=================================================
				// 활성화__여부
				IF ( $disabled) 														$str .= " ". $disabled;


				//=================================================
				// TAG_문자열
				$str .= ">\n";


				//=================================================
				// 시작 => 반복문
				FOR ( $i=$start_id; $i<=$end_id; $i++ )
				{
						$str .= '<option value="'. $i .'"';
						if ($i == $selected)
								$str .= ' selected="selected"';
						$str .= ">". $i ."</option>\n";
				}
				// 끝 => 반복문
				//=================================================


				//=================================================
				// TAG_문자열__마무리
				$str .= "</select>\n";


				//=================================================
				// 넘겨주기
				return $str;

		}
		#######################################################
		# 끝 => 회원권한을__SELECT_형식으로__얻음
		#######################################################



		#######################################################
		# 시작 => 항목_별__나눔_숫자
		#######################################################
		function get__div_num($div_code, $var_n)
		{

				//=================================================
				// 자료_나눌_번호
				$row_div_n = 0;


				//=================================================
				// 시작 => 게시글_코드__구분
				SWITCH ($div_code)
				{
						CASE 'comment' :			$row_div_n = 10000000;			BREAK;
						CASE 'image' :				$row_div_n = 10000000;			BREAK;
						CASE 'dir_file' :			$row_div_n = 10000;					BREAK;
						DEFAULT :							$row_div_n = 10000000;			BREAK;
				}
				// 끝 => 게시글_코드__구분
				//=================================================


				//=================================================
				// 넘겨주기
				return $row_div_n;

		}
		#######################################################
		# 끝 => 항목_별__나눔_숫자
		#######################################################


###########################################################
# 끝 => 일반__함수
###########################################################






###########################################################
# 시작 => 디렉토리_파일__관련
###########################################################


		#######################################################
		# 시작 => 디렉토리__만들기
		#######################################################
		function mkdir_chmod($dir_s)
		{

				//=================================================
				// 시작 => 1차_디렉토리__없으면__만들기
				IF ( $dir_s )
				{

						//=============================================
						// 시작 => 1차_디렉토리__없으면__만들기
						IF ( !is_dir($dir_s) )
						{

								//=========================================
								// 디렉토리__만들기
								mkdir($dir_s, G5_DIR_PERMISSION);
								chmod($dir_s, G5_DIR_PERMISSION);

						}
						// 끝 => 1차_디렉토리__없으면__만들기
						//=============================================

				}
				// 끝 => 1차_디렉토리__없으면__만들기
				//=================================================

		}
		#######################################################
		# 끝 => 디렉토리__만들기
		#######################################################



		#######################################################
		# 시작 => 디렉토리_내__파일__삭제
		#######################################################
		function delete__dir_file($dir)
		{

				IF ( $dirHandle = opendir($dir) )
				{

						chdir($dir);

						WHILE (  $file = readdir($dirHandle) )
						{

								IF ( $file == '.' || $file == '..' )				CONTINUE;

								IF ( is_dir($file) )												delete__dir_file($file);
								ELSE																				unlink($file);
						}

						chdir('..');

						rmdir($dir);

						closedir($dirHandle);

				}

		}
		#######################################################
		# 끝 => 디렉토리_내__파일__삭제
		#######################################################



		#######################################################
		# 시작 => 이미지_썸네일__삭제
		#######################################################
		function delete__thumbnail($dir, $file)
		{

			if(!$dir || !$file)
					return;

			$filename = preg_replace("/\.[^\.]+$/i", "", $file); // 확장자제거

			$files = glob($dir.'/thumb-'.$filename.'*');

			if(is_array($files)) {
					foreach($files as $thumb_file) {
							@unlink($thumb_file);
					}
			}

		}
		#######################################################
		# 끝 => 이미지_썸네일__삭제
		#######################################################


###########################################################
# 끝 => 디렉토리_파일__관련
###########################################################






###########################################################
# 시작 => 피리_웹__프로그램
###########################################################


		#######################################################
		# 시작 => 상수__변수__배열
		#######################################################


		//=====================================================
		// 게시글_자료__구분
		$arti_code_arr['board']		= array('code' => 'board',		'name' => '게시판',	'save_var' => 'idx_v_n',	'choice_2' => 0,	'title_2' => '');
		$arti_code_arr['article']	= array('code' => 'article',	'name' => '게시글',	'save_var' => 'idx_v_n',	'choice_2' => 1,	'title_2' => '게시판');
		$arti_code_arr['image']		= array('code' => 'image',		'name' => '이미지',	'save_var' => 'idx_v_n',	'choice_2' => 0,	'title_2' => '');
		$arti_code_arr['member']	= array('code' => 'member',		'name' => '회원',	  'save_var' => 'idx_v_s',	'choice_2' => 0,	'title_2' => '');


		#######################################################
		# 끝 => 상수__변수__배열
		#######################################################




		#######################################################
		# 시작 => 구성_디렉토리__파일__경로__알아내기
		#######################################################
		function get__sam_file($program_n, $file_s = '', $path_div = 'path')
		{

				//=================================================
				// 넘겨줄__값
				$return_var = "";


				//=================================================
				// 시작 => 프로그램_번호__있으면
				IF ( (int)$program_n > 0 )
				{

						//=============================================
						// 시작 => 파일_이름__없으면
						IF ( $file_s == "config" )
						{
								$file_s = "__config.php";
						}
						// 끝 => 파일_이름__없으면
						//=============================================


						//=============================================
						// 시작 => 경로__구분
						SWITCH ( $path_div )
						{

								###########################################
								# 시작 => 디렉토리
								CASE 'dir' :

										// 디렉토리_이름
										$return_var = "p". $program_n;

								BREAK;


								###########################################
								# 시작 => URL
								CASE 'url' :

										// 파일__경로
										$return_var = PIREE_URL ."/p". $program_n ."/". $file_s;

								BREAK;


								###########################################
								# 시작 => 경로
								DEFAULT :

										// 파일__경로
										$return_var = PIREE_PATH ."/p". $program_n ."/". $file_s;

								BREAK;

						}
						// 끝 => 경로__구분
						//=============================================

				}
				// 끝 => 프로그램_번호__있으면
				//=================================================


				//=================================================
				// 넘겨주기____프로그램_경로
				return $return_var;

		}
		#######################################################
		# 끝 => 구성_디렉토리__파일__경로__알아내기
		#######################################################



		#######################################################
		# 시작 => 주소복사__버튼
		# 시작 => PWP__770036__SH_URL
		#######################################################
		function view__sh_url_copy_button()
		{

		 		//=================================================
				// 전역변수
				global $list_index_url, $view_index_url, $image_index_url;


		 		//=================================================
				// 주소복사_기능__출력하기
		  	add_javascript('<script type="text/javascript" src="'. PIREE_JS_URL .'/zclip/jquery.zclip.js"></script>', 77);
		  	add_javascript('<script type="text/javascript" src="'. PIREE_JS_URL .'/zclip/jquery.zclip.min.js"></script>', 77);
?>
				<script type="text/javascript">
						$(document).ready(function(){
<?php

								//=========================================
								// 시작 => 게시판_URL__있으면
								IF ( $list_index_url )
								{
?>
										//=====================================
										// 게시판_URL__복사
										$('a#copy-list_url').zclip({
												path:'<?php echo PIREE_JS_URL ?>/zclip/ZeroClipboard.swf',
												copy:$('span#list_index_url').text()
										});
<?php
								}
								// 끝 => 게시판_URL__있으면
								//=========================================


								//=========================================
								// 시작 => 게시글_URL__있으면
								IF ( $view_index_url)
								{
?>
										//=====================================
										// 게시글_URL__복사
										$('a#copy-view_url').zclip({
												path:'<?php echo PIREE_JS_URL ?>/zclip/ZeroClipboard.swf',
												copy:$('span#view_index_url').text()
										});
<?php
								}
								// 끝 => 게시글_URL__있으면
								//=========================================


								//=========================================
								// 시작 => 이미지_URL__있으면
								IF ( $image_index_url)
								{
?>
										//=====================================
										// 이미지_URL__복사
										$('a#copy-image_idx_url').zclip({
												path:'<?php echo PIREE_JS_URL ?>/zclip/ZeroClipboard.swf',
												copy:$('span#image_idx_url').text()
										});
<?php
								}
								// 끝 => 이미지_URL__있으면
								//=========================================

?>
						});
				</script>
<?php

		}
		#######################################################
		# 끝 => 주소복사__버튼
		#######################################################



		#######################################################
		# 시작 => 숫자로만__가져오기
		#######################################################
		function get__number($var_n)
		{

				//=================================================
				// 시작 => 인자__있으면
				IF ( $var_n > 0 )
				{

						//=============================================
						// 숫자만_구하기
						$var_n = str_replace(" ", "", $var_n);
						$var_n = str_replace(",", "", $var_n);
						$var_n = str_replace(".", "", $var_n);
						$var_n = trim($var_n);
						$var_n = (int)$var_n;

				}
				// 끝 => 인자__있으면
				//=================================================


				//=================================================
				// 넘겨주기
				return $var_n;

		}
		#######################################################
		# 끝 => 숫자로만__가져오기
		#######################################################



		#######################################################
		# 시작 => 문자_다듬어__가져오기
		#######################################################
		function get__str($var_s, $strip_c)
		{

				//=================================================
				// 앞_뒤_공백_제거하기
				// 쿼터_제거하기
				$var_s = trim($var_s);
				$var_s = stripslashes(stripslashes($var_s));


				//=================================================
				// 시작 => 쿼터_추가하기
				IF ( $strip_c == 'add' )
				{
						$var_s = addslashes($var_s);
				}
				// 끝 => 쿼터_추가하기
				//=================================================


				//=================================================
				// 넘겨주기
				return $var_s;

		}
		#######################################################
		# 끝 => 문자_다듬어__가져오기
		#######################################################



		#######################################################
		# 시작 => 저장할__문자열__다듬기
		#######################################################
		function save_str($in_str)
		{

				//=================================================
				// 저장할__문자열__다듬기
	 			$in_str = preg_replace("#[\\\]+$#", "", $in_str);
	 			$in_str = addslashes( clean_xss_tags( stripslashes( trim( $in_str ) ) ) );


				//=================================================
				// 넘겨주기
				return $in_str;

		}
		#######################################################
		# 끝 => 저장할__문자열__다듬기
		#######################################################



		#######################################################
		# 시작 => 저장할__문자열__다듬기
		#######################################################
		function check_bad_code($in_str, $fd_name)
		{

				//=================================================
				// 시작 => 나쁜_코드__검증하기
				IF (substr_count($in_str, '&#') > 50)
				{
						// 에러
						alert('[ '. $fd_name .' ]에 올바르지 않은 코드가 다수 포함되어 있습니다.');
						return false;
				}
				// 끝 => 나쁜_코드__검증하기
				//=================================================

		}
		#######################################################
		# 끝 => 저장할__문자열__다듬기
		#######################################################



		#######################################################
		# 시작 => 문자열__깔끔하게__다듬기
		#######################################################
		function clean_str($in_str)
		{

				//=================================================
				// 문자열__깔끔하게__다듬어서__돌려주기
				return clean_xss_tags( strip_tags( stripslashes( trim( $in_str ) ) ) );

		}
		#######################################################
		# 끝 => 문자열__깔끔하게__다듬기
		#######################################################



		#######################################################
		# 시작 => 문자열__깨끗하게__다듬기
		#######################################################
		function get__clean_str($in_str)
		{

				//=================================================
				// 문자열__깔끔하게__다듬어서__돌려주기
				return clean_xss_tags( get_text (stripslashes( trim( $in_str ) ) ) );

		}
		#######################################################
		# 끝 => 문자열__깨끗하게__다듬기
		#######################################################


###########################################################
# 끝 => 피리_웹__프로그램
###########################################################






###########################################################
# 시작 => 그누보드__관련
###########################################################


		#######################################################
		# 시작 => 게시판_테이블_링크__가져오기
		#######################################################
		function get_write_link($bo_table, $wr_id = 0, $region_n = 0, $election_type_s = '')
		{

				//=================================================
				// 링크
				$fnc_link_s = "";


				//=================================================
				// 시작 => 게시판_코드__있으면
				IF ( $bo_table )
				{

						//=============================================
						// 링크
						$fnc_link_s = G5_BBS_URL .'/board.php?bo_table='. $bo_table;

				}
				// 끝 => 게시판_코드__있으면
				//=================================================


				//=================================================
				// 시작 => 게시글_번호__있으면
				IF ( $wr_id > 0 )
				{

						//=============================================
						// 링크
						$fnc_link_s.= '&wr_id='. $wr_id;

				}
				// 끝 => 게시글_번호__있으면
				//=================================================


				//=================================================
				// 넘겨주기____게시판_게시글_링크
				return $fnc_link_s;

		}
		#######################################################
		# 끝 => 게시판_테이블_링크__가져오기
		#######################################################



		#######################################################
		# 시작 => 게시판_테이블_전체이름__가져오기
		#######################################################
		function get_write_table($bo_table)
		{

				//=================================================
				// 전역변수
				global $g5;


				//=================================================
				// 게시판_테이블_전체이름
				$write_table = $g5['write_prefix'] . $bo_table;


				//=================================================
				// 넘겨주기____게시판_테이블_전체이름
				return $write_table;

		}
		#######################################################
		# 끝 => 게시판_테이블_전체이름__가져오기
		#######################################################


###########################################################
# 끝 => 그누보드__관련
###########################################################


?>