<?php

/*
===========================================================

	프로젝트 이름 : 피리 맵 페이지

	만든사람 : 피리 PIREE

	홈페이지 : http://www.piree.co.kr

	작성날짜 : 2015년 12월 27일 일요일 오후 19시 58분 - 날씨 춥다 

	저 작 권 : Copyright ⓒ 2014-2015 투스포츠 (원병철) All right reserved
							그누보드 외에 추가된 소스는~
							만든사람의 허락없이 무단으로 사용할수 없습니다.
							사용하고자 할 경우 만든사람의 허락을 받아야 합니다.
							http://www.piree.co.kr 에 문의해 주세요.

===========================================================
 피리 SAM > 관리자 > 피리 맵 페이지 > 게시판 목록
===========================================================


*/


	#########################################################
	# 시작 => 최_우선__상수__변수
	#########################################################

	//=======================================================
	// 메뉴_번호__지정____피리_맵_페이지
	$sub_menu = 770033;

	#########################################################
	# 끝 => 최_우선__상수__변수
	#########################################################



	#########################################################
	# 시작 => 선_처리
	#########################################################

	//=======================================================
	// 기본처리_파일__첨부
	include_once('./_common.php');

	#########################################################
	# 끝 => 선_처리
	#########################################################



	#########################################################
	# 시작 => 선_처리__관리자_확인
	#########################################################

	//=======================================================
	// 시작 => 회원_여부__확인
	IF ($is_guest || !$is_member)
	{
			alert ("회원만 이용하실 수 있습니다.", G5_DOMAIN."/");
			EXIT;
	}
	// 끝 => 회원_여부__확인
	//=======================================================


	//=======================================================
	// 시작 => 관리자__아니면
	IF (!$is_admin)
	{
			alert ("권한이 없습니다.", G5_DOMAIN."/");
			EXIT;
	}
	// 끝 => 관리자__아니면
	//=======================================================


	//=======================================================
	// 관리자_확인
	auth_check($auth[$sub_menu], 'r');

	#########################################################
	# 끝 => 선_처리__관리자_확인
	#########################################################



	#########################################################
	# 시작 => 피리_맵_페이지__설정_정보_파일__첨부
	#########################################################

	//=======================================================
	// 기본_설정_첨부__여부
	// 0 - 안해
	// 1 - 하자
	$is_get__piree_config = 0;


	//=======================================================
	// 설정_정보__가져오기
	$is_get__p770033 = 1;


	//=======================================================
	// 설정_화면__여부
	$is_piree_program_config = 0;


	//=======================================================
	// 설정_정보_화일__첨부
	include_once( get__sam_file($sub_menu, 'config', 'path') );

	#########################################################
	# 끝 => 피리_맵_페이지__설정_정보_파일__첨부
	#########################################################



	#########################################################
	# 시작 => 상수__변수
	#########################################################

	//=======================================================
	// 게시판__수
	$board_t = 0;


	//=======================================================
	// 게시판___배열
	$board_arr = array();

	#########################################################
	# 끝 => 상수__변수
	#########################################################



	#########################################################
	# 시작 => 필드__유무__확인하기
	#########################################################

	//=======================================================
	// 필드_추가__처리_파일
	include "./board.field_add.inc.php";

	#########################################################
	# 끝 => 필드__유무__확인하기
	#########################################################



	#########################################################
	# 시작 => 게시판__목록__불러오기
	#########################################################

			#####################################################
			# 시작 => 게시판__수__파악하기
			#####################################################

			//===================================================
			// 게시판__수__파악하는__쿼리문
			$sql		 = "SELECT COUNT(*) FROM `".$g5['board_table']."`";
			$board_t = sql_efv($sql);
			$board_t = (int)$board_t;

			#####################################################
			# 끝 => 게시판__수__파악하기
			#####################################################



			#####################################################
			# 시작 => 게시판__목록__불러오기
			#####################################################
			IF ($board_t > 0)
			{

					#################################################
					# 시작 => 게시판__목록__불러오기
					#################################################

					//===============================================
					// 게시판__불러오기
					$sql		= "SELECT * ";
					$sql	 .= "FROM `".$g5['board_table']."` ORDER BY gr_id, bo_table ASC";
					$result = sql_query ($sql);


					//===============================================
					// 시작 => 반복문__돌리기
					FOR ($i=0; $row=sql_fetch_array($result); $i++)
					{

							//===========================================
							// 게시판_PC_이름__쿼터_제거
							$bo_subject = stripslashes($row["bo_subject"]);


							//===========================================
							// 게시판_모바일_이름__쿼터_제거
							$bo_mobile_subject = stripslashes($row["bo_mobile_subject"]);


							//===========================================
							// 게시판___배열
							$board_arr[] = array(
																	 "bo_table"=>$row['bo_table'],
																	 "gr_id"=>$row["gr_id"],
																	 "bo_subject"=>$bo_subject,
																	 "bo_mobile_subject"=>$bo_mobile_subject,
																	 "bo_skin"=>$row["bo_skin"],
																	 "bo_mobile_skin"=>$row["bo_mobile_skin"],
																	 "bo_arti_list_skin_ok"=>$row["bo_arti_list_skin_ok"]
																	 );


							//===========================================
							// 게시판__수
							$board_t++;

					}
					// 끝 => 반복문__돌리기
					//===============================================

					#################################################
					# 끝 => 게시판__목록__불러오기
					#################################################

			}
			#####################################################
			# 끝 => 게시판__불러오기
			#####################################################

	#########################################################
	# 끝 => 게시판__목록__불러오기
	#########################################################



	#########################################################
	# 시작 => 화면_ECHO
	#########################################################

	//=======================================================
	// 타이틀
	$g5['title'] = "게시글 목록 스킨에서 처리";


	//=======================================================
	// HEAD__첨부
	include_once ("../admin.head.php");


	//=======================================================
	// add_stylesheet('css 구문', 출력순서); 숫자가 작을 수록 먼저 출력됨
	add_stylesheet('<link rel="stylesheet" href="'.G5_ADMIN_URL.'/p770010__bo_cate/style.css">', 0);

	#########################################################
	# 끝 => 화면_ECHO
	#########################################################


?>

<section>
		<h2>게시글 목록 스킨에서 처리</h2>

		<div class="cl_bo line_h_2_0" style="margin:4px 20px 4px 20px">
				<span class="help_ment_green_1">이 화면은 "게시판 게시글 목록을 가져오는 방식"을 결정하는 화면입니다.</span><br />
				<span class="help_ment_green_1">"리스트 스킨에서 처리"를 체크하시면 게시글 목록을 가져오는 파일이 /<?php echo G5_BBS_DIR ?>/list.php 파일이 아니라 각 스킨의 list.skin.php에서 처리합니다.</span><br />
				<span class="help_ment_green_1">"피리 맵 페이지"을 사용하려는 게시판은 "리스트 스킨에서 처리"를 체크하셔야 합니다.</span><br />
				<span class="help_ment_green_1">게시판 스킨 "piree_basic_map"을 사용하는 게시판은 "리스트 스킨에서 처리"를 체크하셔야 합니다.</span>
		</div>


		<form method="post" id="board_list_form" name="board_list_form" action="./board_list.update.php">

		<div class="tbl_head01 tbl_wrap">
				<table>
				<caption>게시글 목록 스킨에서 처리</caption>
				<thead>
				<tr>
					<th scope="col">그룹</th>
					<th scope="col">테이블</th>
					<th scope="col">리스트 스킨에서 처리</th>
					<th scope="col">PC 이름</th>
					<th scope="col">모바일 이름</th>
					<th scope="col">PC 스킨</th>
					<th scope="col">모바일 스킨</th>
				</thead>
				<tbody>

<?php


		//=====================================================
		// 시작 => 게시판__유무
		IF ($board_t > 0)
		{

			#####################################################
			# 시작 => 게시판__있으면
			#####################################################

			//===================================================
			// 순서
			$i = 0;


			//===================================================
			// 배열_복사
			$board_temp_arr = $board_arr;


			//===================================================
			// 시작 => 반복문__돌리기
			WHILE (list($key, $val) = each($board_arr))
			{

				//=================================================
				// 게시판_코드
				$bo_subject = $val["bo_table"];

?>
				<tr>
					<td><?php echo $val["gr_id"] ?></td>
					<td><a href="<?php echo G5_ADMIN_URL ?>/board_form.php?w=u&bo_table=<?php echo $val["bo_table"] ?>" target="_blank"><?php echo $val["bo_table"] ?></a></td>
					<td class="td_center"><input type="checkbox" id="arti_list_skin_<?php echo $bo_subject ?>" name="arti_list_skin_ok_arr[<?php echo $bo_subject ?>]" value="1"<?php	IF ($val["bo_arti_list_skin_ok"] == 1) echo " checked";	?>> 리스트 스킨에서 처리</td>
					<td><a href="<?php echo G5_BBS_URL ?>/board.php?bo_table=<?php echo $val["bo_table"] ?>&device=pc" target="_blank"><?php echo $val["bo_subject"] ?></a></td>
					<td><a href="<?php echo G5_BBS_URL ?>/board.php?bo_table=<?php echo $val["bo_table"] ?>&device=mobile" target="_blank"><?php echo $val["bo_mobile_subject"] ?></a></td>
					<td><?php echo $val["bo_skin"] ?></td>
					<td><?php echo $val["bo_mobile_skin"] ?></td>
				</tr>

<?php

				//=================================================
				// 순서__증가
				$i++;

			}
			// 끝 => 반복문__돌리기
			//===================================================

			#####################################################
			# 끝 => 게시판__있으면
			#####################################################

		}
		ELSE
		{

			#####################################################
			# 시작 => 게시판__없으면
			#####################################################

?>
				<tr>
					<td colspan="11" align="center"><strong>게시판이 없습니다.</strong></td>
				</tr>

<?php

			#####################################################
			# 끝 => 게시판__없으면
			#####################################################

		}
		// 끝 => 게시판__유무
		//=====================================================

?>

				</tbody>
				</table>
		</div>


		<div class="btn_confirm">
			<input type="submit" class="btn_submit" name="act_button" value="선택수정">
		</div>

		</form>

</section>


<?php

	//=======================================================
	// ADMIN_TAIL__첨부
	include_once ("../admin.tail.php");

?>