<?php

/*
===========================================================

	프로젝트 이름 : 피리 맵 페이지

	만든사람 : 피리 PIREE

	홈페이지 : http://www.piree.co.kr

	작성날짜 : 2016년 01월 24일 일요일 오전 04시 34분 - 날씨 추워, 추워!! 너무 추워!!

	저 작 권 : Copyright ⓒ 2014-2015 투스포츠 (원병철) All right reserved
							그누보드 외에 추가된 소스는~
							만든사람의 허락없이 무단으로 사용할수 없습니다.
							사용하고자 할 경우 만든사람의 허락을 받아야 합니다.
							http://www.piree.co.kr 에 문의해 주세요.

===========================================================
 피리 SAM > 관리자 > 피리 맵 페이지 > 처음
===========================================================


*/


	#########################################################
	# 시작 => 최_우선__상수__변수
	#########################################################

	//=======================================================
	// 메뉴_번호__지정____피리_맵_페이지
	$sub_menu = 770033;

	#########################################################
	# 끝 => 최_우선__상수__변수
	#########################################################



	#########################################################
	# 시작 => 선_처리
	#########################################################

	//=======================================================
	// 기본처리_파일__첨부
	include_once('./_common.php');

	#########################################################
	# 끝 => 선_처리
	#########################################################



	#########################################################
	# 시작 => 선_처리__관리자_확인
	#########################################################

	//=======================================================
	// 시작 => 회원_여부__확인
	IF ($is_guest || !$is_member)
	{
			alert ("회원만 이용하실 수 있습니다.", G5_DOMAIN."/");
			EXIT;
	}
	// 끝 => 회원_여부__확인
	//=======================================================


	//=======================================================
	// 시작 => 관리자__아니면
	IF (!$is_admin)
	{
			alert ("권한이 없습니다.", G5_DOMAIN."/");
			EXIT;
	}
	// 끝 => 관리자__아니면
	//=======================================================


	//=======================================================
	// 관리자_확인
	auth_check($auth[$sub_menu], 'r');

	#########################################################
	# 끝 => 선_처리__관리자_확인
	#########################################################



	#########################################################
	# 시작 => 피리_맵_페이지__설정_정보_파일__첨부
	#########################################################

	//=======================================================
	// 기본_설정_첨부__여부
	// 0 - 안해
	// 1 - 하자
	$is_get__piree_config = 0;


	//=======================================================
	// 설정_정보__가져오기
	$is_get__p770033 = 1;


	//=======================================================
	// 설정_화면__여부
	$is_piree_program_config = 0;


	//=======================================================
	// 설정_정보_화일__첨부
	include_once( get__sam_file($sub_menu, 'config', 'path') );

	#########################################################
	# 끝 => 피리_맵_페이지__설정_정보_파일__첨부
	#########################################################



	#########################################################
	# 시작 => 프로그램_정보__유무_확인
	#########################################################

	//=======================================================
	// 시작 => 사용할__지도_선택__없으면
	// 시작 => 기본__줌__없으면
	// 시작 => 보이는__큰_마커_수__없으면
	IF ( !$p770033__use_map_c || !$p770033__basic_zoom )
	{

			// 이동할__페이지
			$move_url = G5_ADMIN_URL.'/p'.PIREE_PROG_PLUS_MENU_N.'/';

			// 에러_알림
			alert ("[ 피리 맵 페이지 ] 프로그램 정보가 없습니다.\\n\\n설치 및 설정 화면으로 이동합니다.", $move_url);
			EXIT;

	}
	// 끝 => 사용할__지도_선택__없으면
	// 끝 => 기본__줌__없으면
	// 끝 => 보이는__큰_마커_수__없으면
	//=======================================================

	#########################################################
	# 끝 => 프로그램_정보__유무_확인
	#########################################################



	#########################################################
	# 시작 => 화면_ECHO
	#########################################################

	//=======================================================
	// 타이틀
	$g5['title'] = "피리 맵 페이지 PLUS G5";


	//=======================================================
	// HEAD__첨부
	include_once('../admin.head.php');


	//=======================================================
	// 상단_링크
	include_once('top_menu.php');

	#########################################################
	# 끝 => 화면_ECHO
	#########################################################


?>



<section>
		<h2>피리 맵 페이지</h2>

		<div class="tbl_head01 tbl_wrap">
				<table>
				<caption>피리 맵 페이지 PLUS G5</caption>
				<thead>
				<tr>
						<th scope="col">사용할 지도</th>
						<th scope="col">구글맵 KEY</th>
						<th scope="col">다음 지도 KEY</th>
						<th scope="col">네이버 지도	KEY</th>
						<th scope="col">지도 적용</th>
						<th scope="col">현재위치 사용</th>
						<th scope="col">처음 좌표</th>
						<th scope="col">기본 줌</th>
						<th scope="col">작은 마커</th>
				</tr>
				</thead>
				<tbody>

				<tr>
						<td><?php echo $map_list_arr[$p770033__use_map_c]; ?></td>
						<td><?php echo $p770033__api_key_google_map; ?></td>
						<td><?php echo $p770033__api_key_daum_map; ?></td>
						<td><?php echo $p770033__api_key_naver_map; ?></td>
						<td><?php echo $map_config_region_arr[$p770033__map_view_area]; ?></td>
						<td><?php IF ( $p770033__now_here_point == 1 ) { echo "사용"; } else { echo "사용안함"; }	?></td>
						<td><?php echo $p770033__map_start_point_lng; ?><br><?php echo $p770033__map_start_point_lat; ?></td>
						<td><?php echo $p770033__basic_zoom; ?></td>
						<td><?php echo $p770033__view_marker_small_t; ?></td>
				</tr>

				</tbody>
				</table>
		</div>


		<br />


		<div class="btn_confirm">
				<input type="button" class="btn_cancel" value="설정 정보 수정하기" onClick="PageUrl('./__config.form.php')"> 
				<input type="button" class="btn_cancel" value="게시글 목록 스킨에서 처리 선택" onClick="PageUrl('./board_list.php')">
		</div>

		</form>

</section>


<?php

	//=======================================================
	// ADMIN_TAIL__첨부
	include_once("../admin.tail.php");

?>